In [2]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

Requirement already satisfied: pandas in d:\anaconda\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in d:\anaconda\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in d:\anaconda\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in d:\anaconda\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in d:\anaconda\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
import pandas as pd

In [4]:
column = ['Hari','Messi','Dhoni']

In [5]:
column

['Hari', 'Messi', 'Dhoni']

In [6]:
data = pd.DataFrame(column)

In [7]:
data

       0
0   Hari
1  Messi
2  Dhoni

In [8]:
titled_column = {"name": column}

In [9]:
data = pd.DataFrame(titled_column)

In [10]:
data
# Pandas indeed uses the dictionary keys as column names when you create a DataFrame from a dictionary.

    name
0   Hari
1  Messi
2  Dhoni

In [12]:
titled_columns = {"name": column,
                 "height":[1.76,1.70,1.8],
                  "weight":[72,70,75]}

In [13]:
data = pd.DataFrame(titled_columns)

In [14]:
data

    name  height  weight
0   Hari    1.76      72
1  Messi    1.70      70
2  Dhoni    1.80      75

In [15]:
# SELECTING COLUMNS/VALUES FROM DATA FRAME

In [16]:
selected_column = data['weight']

In [17]:
selected_column

0    72
1    70
2    75
Name: weight, dtype: int64

In [18]:
# Selecting messi's weight.This is done by adding index to the key of weight

In [19]:
messi_weight = data["weight"][1]

In [20]:
messi_weight

70

In [21]:
# Selecting rows
# iloc represents rows

In [22]:
selected_row = data.iloc[1]

In [23]:
selected_row
# This selected the entire.

name      Messi
height      1.7
weight       70
Name: 1, dtype: object

In [24]:
# To check for only the weight

In [25]:
selected_row = data.iloc[1]["weight"]

In [26]:
selected_row

70

In [27]:
# MANIPULATING DATAFRAME VALUES

In [28]:
bmi = []

In [29]:
#bmi = weight/(height**2)

In [32]:
for i in range(len(data)):
    bmi_score = data["weight"][i]/(data["height"][i] ** 2)
    bmi.append(bmi_score)

 # Creating new column bmi in the dataframe
data["BMI"] = bmi

In [33]:
data

    name  height  weight        BMI
0   Hari    1.76      72  23.243802
1  Messi    1.70      70  24.221453
2  Dhoni    1.80      75  23.148148

In [34]:
# SAVING DATA FRAME TO A FILE

In [36]:
data.to_csv("BMI.csv")